Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: འདི་ལྟ་སྟེ་དཔེར་ན་དགེ་སློང་བསམ་གཏན་གསུམ་པ་ལ་སྙོམས་པར་ཞུགས་པ་དེ་ལྟ་བུར་ལུས་ཀྱི་བདེ་བ་ཚོར་བར་གྱུར་ཏེ། དེ་ལྟར་ལུས་ངལ་བ་མེད་པ་དང་།
en: Through the power of the Bhagavat the king experienced no physical fatigue but felt physical bliss, just as when a bhikṣu in the meditation of the third dhyāna has no physical or mental fatigue.

source: སེམས་ངལ་བ་མེད་པར་ཟླ་བ་གསུམ་དུ་བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བྱས་སོ།
en: He honored the Bhagavat in that way for three months. “

source: །དེ་བཞིན་དུ་རྒྱལ་བུ་སྟོང་དང་། ཁམས་ཀྱི་རྒྱལ་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། གཞན་ཡང་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་གྱིས་ཀྱང་ཉན་ཐོས་རེ་རེ་ལ་ཟླ་བ་གསུམ་དུ་རྒྱལ་པོའི་ཡོ་བྱད་དང་། དེ་ལྟ་བུའི་བསྙེན་བཀུར་གྱིས་བསྙེན་བཀུར་བྱས་སོ།
en: During those three months, the thousand princes, the 84,000 minor kings, and a hundred thousand million trillion beings honored each śrāvaka in the same way that the king did. “

source: །ཅི་ལྟར་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ་དེ་བཞིན་དུ་བཙུན་མོ་དམ་པ་ལྷ་མོ་དཔལ་གྱིས་ཀྱང་ཟླ་བ་གསུམ་དུ་སྤོས་དང་། མེ་ཏོག་དག་གིས་བསྙེན་བཀུར་བྱས་སོ།
en: During those three months, the principal queen, Glorious Goddess, honored the Tathāgata Ratnagarbha with incense and flowers in the same way that King Araṇemin had honored him.

source: །དེ་བཞིན་དུ་བུ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་གིས་ཀྱང་ཉན་ཐོས་རེ་རེ་ལ་ཟླ་བ་གསུམ་དུ་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དག་གིས་བསྙེན་བཀུར་བྱས་སོ།
en: Also in the same way, during those three months, many hundreds of thousands of millions of trillions of maidens honored each śrāvaka with flowers and incense. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་ཟླ་བ་གསུམ་པོ་འདས་ནས་བཅོམ་ལྡན་འདས་ལ་འཛམ་བུའི་ཆུ་བོའི་གསེར་ལས་བྱས་པའི་རྒྱན་བརྒྱད་ཁྲི་བཞི་སྟོང་ཕུལ་ལོ།
en: Then, noble son, after the three months had passed, King Araṇemin offered 84,000 adornments made from Jambu River gold to the Bhagavat.

source: །བཅོམ་ལྡན་འདས་ལ་འཁོར་ལོ་རིན་པོ་ཆེ་ལ་སོགས་པ་གསེར་གྱི་འཁོར་ལོ་རིན་པོ་ཆེ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་ཕུལ་ལོ།
en: He also offered 84,000 wheels of gold, beginning with the precious wheel, to the Bhagavat.

source: །བཅོམ་ལྡན་འདས་ལ་གླང་པོ་རིན་པོ་ཆེ་ལ་སོགས་པ་གླང་པོ་ཆེ་ཐལ་ཀར་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་ཕུལ་ལོ།
en: He offered 84,000 white elephants, beginning with the precious elephant, to the Bhagavat.

source: །བཅོམ་ལྡན་འདས་ལ་རྟ་རིན་པོ་ཆེ་ལ་སོགས་པ་རྟ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་ཕུལ་ལོ།
en: He offered 84,000 horses, beginning with the precious horse, to the Bhagavat.

source: །བཅོམ་ལྡན་འདས་ལ་ནོར་བུ་རིན་པོ་ཆེ་ལ་སོགས་པ་ནོར་བུ་མེ་ཤེལ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་ཕུལ་ལོ།
en: He offered 84,000 jewels, beginning with the precious jewel, to the Bhagavat.

source: །བཅོམ་ལྡན་འདས་དེ་ལ་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་ཁྱིམ་བདག་རིན་པོ་ཆེ་ལ་སོགས་པ་རྒྱལ་བུ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་ཕུལ་ལོ།
en: In order to honor the Bhagavat he also offered to him 84,000 princes, beginning with the precious householder.

source: །བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་བློན་པོ་རིན་པོ་ཆེ་ལ་སོགས་པ་ཁམས་ཀྱི་རྒྱལ་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་ཕུལ་ལོ།
en: In order to honor the Bhagavat he also offered to him 84,000 minor kings, beginning with the precious minister.

source: །བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་གྱི་འཚོ་བའི་ཕྱིར་བཙུན་མོའི་འཁོར་གྱི་གྲོང་ཁྱེར་ལ་སོགས་པ་གྲོང་ཁྱེར་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་ཕུལ་ལོ། །བཅོམ་ལྡན་འདས་ལ་རིན་པོ་ཆེའི་དཔག་བསམ་གྱི་ཤིང་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། རིན་པོ་ཆེའི་མེ་ཏོག་གི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གདུགས་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། རྒྱལ་པོ་ལ་འོས་པའི་གོས་རྒྱན་ཆེན་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་།
en: In order to provide for the Bhagavat and his saṅgha of bhikṣus, he offered to them 84,000 towns, beginning with the town of the queen’s retinue.

source: རིན་པོ་ཆེའི་ཕྲེང་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། རྒྱན་དང་། ཁྲིའུ་དང་། མགོ་ལྟ་བུ་དང་། མིག་ལྟ་བུ་དང་། སྙན་ཆ་གདུབ་འཁོར་དང་། གསེར་གྱི་ཙོང་ཙོང་དང་། མུ་ཏིག་གི་དོ་ཤལ་དང་། ཆགས་དང་། གཟིམས་ཆ་དང་། ཞབས་རྟེན་དང་། སྣོད་དང་། རྔ་བོ་ཆེ་དང་། རོལ་མོའི་སྒྲ་དང་། དུང་དང་། དྲིལ་བུ་དང་། རྒྱལ་མཚན་དང་། རིལ་བ་བྷྲིང་ག་ར་དང་།
en: He offered to the Bhagavat 84,000 precious wish-fulfilling trees, 84,000 heaps of precious flowers, 84,000 parasols made of the seven jewels, 84,000 rolls of cloth and adornments worthy for a king, and 84,000 strings of jewels; he offered ornaments for seats, the head, the eyes, and the ears; and gold chains, strings of pearls, unguents, bedclothes, footstools, vessels, bherī drums, musical instruments, conches, bells, victory banners, consecration vases, and lamps.

source: ཀུན་དགའི་ར་བ་དང་། མར་མེའི་ཀོང་བུ་དག་ཀྱང་ཕུལ་ལོ། །བཅོམ་ལྡན་འདས་ལ་རིན་པོ་ཆེའི་བྱ་དང་། རིན་པོ་ཆེའི་རི་དགས་དང་། བསིལ་ཡབ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་ཕུལ་ལོ།
en: He also made an offering to the Bhagavat of various birds made of precious materials, various animals made of precious materials, and 84,000 fans.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་ལ་སྨན་བཅུད་ཀྱིས་ལེན་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་ཕུལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: He also offered to the tathāgata arhat samyaksam­buddha Ratnagarbha 84,000 medicinal elixirs. “

source: །བཅོམ་ལྡན་འདས་བདག་ནི་བགྱི་བ་མང་ཞིང་བགྱིད་པ་མང་བ་ལགས་ན།
en: Then he said these words: ‘Bhagavat, I am one who has many duties and many tasks.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་བཟོད་པ་མཛད་ཅིང་།
en: Forgive me, Bhagavat.

source: བདག་ཅག་གི་སྐྱེད་མོས་ཚལ་དུ་བཞུགས་པ་དང་།
en: May you remain in our park.

source: བཅོམ་ལྡན་འདས་སྐྱེད་མོས་ཚལ་འདིར་རྟག་ཏུ་དགྱེས་པར་མཛད་དུ་གསོལ།
en: May the Bhagavat always be pleased in this park.

source: བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། ཕྱག་བགྱི་བ་དང་། བསྙེན་བཀུར་བགྱི་བའི་སླད་དུ་བདག་སླད་ཀྱིས་ཀྱང་མཆིའོ།
en: May we again come here to look at the Bhagavat, bow down to him, and honor him.’ “

source: །རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱི་བུ་སྟོང་པོ་གང་ཡིན་པ་དེ་དག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་གཏུགས་ནས། སོ་སོ་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་ཅག་རེ་རེས་ཀྱང་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་དགུང་ཟླ་གསུམ་ཞིག་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བགྱི་བར་འཚལ་ན་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཅག་ལ་གནང་བར་མཛད་དུ་གསོལ།
en: King Araṇemin’s thousand sons also touched the Bhagavat’s feet and each of them made this supplication to the Bhagavat: ‘We ask for the Bhagavat to give his permission that each of us for three months may honor with all things the Bhagavat and his saṅgha of bhikṣus.’ “

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་རྒྱལ་བུ་དེ་དག་ལ་གནང་བར་མཛད་དོ།
en: The Bhagavat gave the princes his permission by remaining silent.

source: །དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་གནང་བར་རིག་ནས། བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་གྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: King Araṇemin understood that he had given his permission, and he bowed his head to the feet of the Bhagavat and to the saṅgha of bhikṣus.

source: ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་ཕྱིར་སོང་ངོ་།
en: He circumambulated them three times and then left the presence of the Bhagavat. “

source: །དེ་ནས་རྒྱལ་བུ་དེ་དག་གི་ཐུ་བོ་མིག་མི་འཛུམས་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་ཟླ་བ་གསུམ་གྱི་བར་དུ་ཇི་ལྟར་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་བསྙེན་བཀུར་བྱས་པ་དེ་ལྟ་བུའི་བསྙེན་བཀུར་བྱ་བས་བསྙེན་བཀུར་བྱས་སོ།
en: Then the crown prince Animiṣa honored the Bhagavat and his saṅgha of bhikṣus for three months in the same way that King Araṇemin had done.

source: །རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱང་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་ལྟ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་ཉིན་མོ་སྐབས་སྐབས་སུ་འོང་ངོ་།
en: Thus, day after day, the thousand princes headed by Animiṣa came to see the Bhagavat and his saṅgha of bhikṣus and to listen to the Dharma. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཡབ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་ཅེས་བྱ་བ་དེ་ཡང་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཉུལ་ཞིང་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དག་ལས་ཟས་སློང་བར་བྱེད་དེ། དེ་ལ་ཟས་དེ་སྦྱིན་པ་ན་ཇི་སྲིད་དུ་ཁྱེའུ་དང་།
en: Then, noble son, the Tathāgata Ratnagarbha’s father, the brahmin named Samudrareṇu, wandered throughout all of Jambudvīpa and begged for alms from men, women, boys, and girls.

source: བུ་མོ་དེ་དག་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་ལ་རབ་ཏུ་འགོད་ཅིང་།
en: When he had received these alms, all those people living in Jambudvīpa were established in the Three Refuges and afterward developed the motivation to attain the highest, most complete enlightenment.

source: རབ་ཏུ་བཀོད་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་མི་བྱེད་པ་དེ་སྲིད་དུ་ལེན་པར་མི་བྱེད་དོ། །དེ་ལྟར་ཉུལ་བ་ན་འཛམ་བུའི་གླིང་ན་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་དེས་གང་ཟས་ཀྱིས་ཡོངས་སུ་མ་བཟུང་བ་དང་། གང་དཀོན་མཆོག་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་ལ་མ་བཀོད་པ་དང་། གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་མ་བསྐྱེད་པ་དང་། གང་བླ་ན་མེད་པའི་ཡེ་ཤེས་ལ་རབ་ཏུ་མ་བཀོད་ཅིང་ཡང་དག་པར་འཛིན་དུ་མ་བཅུག་པའི་མིར་གྱུར་པ་འགའ་ཡང་མེད་དོ།
en: Because of the brahmin Samudrareṇu wandering in this way, there was no human being in Jambudvīpa who had not become a follower of the brahmin Samudrareṇu, who had not been led to the Three Refuges, who had not developed the motivation to attain the highest, most complete enlightenment, and who had not been established in and made to truly believe in the highest wisdom.

source: །སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བའི་གནས་ལ་བཀོད་དོ། །དེ་བཞིན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: Many hundreds of thousands of millions of trillions of beings were led to the Three Refuges, and in this way were made to believe in—and were guided to, brought to, and led to—the highest, most complete enlightenment. “

source: །རྒྱལ་བུ་གཞོན་ནུ་མིག་མི་འཛུམས་ཀྱིས་ཀྱང་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ཟླ་བ་གསུམ་དུ་སྤྱན་དྲངས་ཤིང་། ཇི་ལྟར་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་བསྙེན་བཀུར་བྱས་པ་དེ་ལྟ་བུའི་བསྙེན་བཀུར་གྱིས་བསྙེན་བཀུར་བྱས་ནས་ཟླ་བ་གསུམ་འདས་པ་དང་།
en: The crown prince Animiṣa honored the Bhagavat and his saṅgha of bhikṣus for three months just as King Araṇemin had done.

source: དེས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་འཁོར་ལོ་རིན་པོ་ཆེ་རྩིབས་ཐམས་ཅད་གསེར་ལས་བྱས་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཕུལ་ལོ། །གླང་པོ་ཆེ་དང་། རྟ་དང་། ནོར་བུ་དང་། བུད་མེད་དང་། ཁྱིམ་བདག་དང་།
en: For three months he offered the Bhagavat 84,000 precious wheels, all with gold spokes.

source: བློན་པོ་རིན་པོ་ཆེ་རྣམས་མ་གཏོགས་པ་གླང་པོ་ཆེ་དང་། རྟ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། དེ་བཞིན་དུ་ནོར་བུ་མེ་ཤེལ་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། དཔག་བསམ་གྱི་ཤིང་
en: He offered him—with the exception of the precious elephant, horse, jewel, wife, householder, and minister—84,000 elephants and 84,000 horses, and similarly 84,000 sunstone gems, boys, girls, wish-fulfilling trees, heaps of flowers, parasols, articles of clothing, flower garlands, adornments, precious thrones, ornaments for the head, ornaments for the eyes, earrings, chains of gold, pearl necklaces, unguents, bedclothes, seats, footstools, vessels, bherī drums, musical instruments, conches, paṭaha drums, victory banners, ornate vases, gardens, lamps, various birds made of precious materials, various deer made of precious materials, medicinal elixirs, and so on.

source: དང་། མེ་ཏོག་གི་ཕུང་པོ་དང་། གདུགས་དང་། གོས་དང་། མེ་ཏོག་ཕྲེང་དང་། རྒྱན་དང་། རིན་པོ་ཆེའི་ཁྲིའུ་དང་། མགོ་ལྟ་བུ་དང་། མིག་ལྟ་བུ་དང་། སྙན་ཆ་གདུབ་འཁོར་དང་། གསེར་གྱི་ཙོང་ཙོང་དང་། མུ་ཏིག་གི་དོ་ཤལ་དང་། ཆགས་དང་། གཟིམས་ཆ་དང་། གདན་དང་། ཞབས་རྟེན་དང་། སྣོད་དང་། རྔ་བོ་ཆེ་དང་། རོལ་མོའི་སྒྲ་དང་། དུང་དང་། རྔ་པ་ཊ་ཧ་དང་།
en: He also offered the same to the saṅgha of bhikṣus. “

source: རྒྱལ་མཚན་དང་། རིལ་བ་བྷྲིང་ག་ར་དང་། ཀུན་དགའི་ར་བ་དང་། མར་མེའི་ཀོང་བུ་དང་། རིན་པོ་ཆེའི་བྱ་སྣ་ཚོགས་དང་།
en: Then the crown prince Animiṣa took his leave from the Bhagavat and the saṅgha of bhikṣus.

source: རིན་པོ་ཆེའི་རི་དགས་སྣ་ཚོགས་དང་། སྨན་བཅུད་ཀྱིས་ལེན་ལ་སོགས་པ་སྣ་རེ་རེ་ཞིང་ཡང་བརྒྱད་ཁྲི་བཞི་སྟོང་བཞི་སྟོང་ཡང་ཕུལ་ལོ། །དགེ་སློང་གི་དགེ་འདུན་ལ་ཡང་དེ་སྙེད་ཕུལ་ལོ། །དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་མིག་མི་འཛུམས་ཀྱིས་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་བཟོད་པ་གསོལ་ཏེ། རྒྱལ་བུ་གཞོན་ནུ་མིག་མི་འཛུམས་ཀྱིས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་ཇི་ལྟར་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་བསྙེན་བཀུར་བྱས་པ་དེ་ལྟ་བུའི་བསྙེན་བཀུར་གྱིས་བསྙེན་བཀུར་བྱས་ཤིང་དེ་ལས་མི་ཉུང་བའི་ཡོན་ཡང་ཕུལ་ལོ།
en: Thus, the crown prince Animiṣa honored the Bhagavat and the saṅgha of bhikṣus just as King Araṇemin had honored them, and his offerings were no less than the king’s. “

source: །དེ་བཞིན་དུ་རྒྱལ་བུ་གཞོན་ནུ་དབང་པོའི་ཚོགས་ཀྱིས་ཀྱང་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་ཟླ་བ་གསུམ་གྱི་བར་དུ་འབྱོར་པ་ཡོངས་སུ་བཏང་ཞིང་བསྙེན་བཀུར་བྱས་སོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ་རྒྱལ་བུ་གཞོན་ནུ་ཉོན་མོངས་མེད་དང་། འཇིགས་མེད་དང་། ནམ་མཁའ་དང་། ཡན་ལག་སྐྱེས་དང་། གྲུབ་པ་དང་། འགྲན་མེད་དང་། མཉེན་དེས་དང་། གྲུམ་པོར་འགྲང་བ་དང་། འདྲོན་པ་ཅན་དང་། ཤེད་བུ་དང་། ཤ་བོ་ཆེ་དང་། འདུས་པ་ཅན་དང་། རྩིབས་ཅན་དང་། ཤེས་པ་ཅན་དང་། གདོང་ཅན་དང་། ནོར་མང་དང་། དགྲ་དབང་དང་། མིག་ཅན་དང་། གླང་པོ་འཐོབ་དང་། ཟླ་བའི་མུ་ཁྱུད་དང་། ཉི་མའི་མུ་ཁྱུད་དང་། དབང་པོའི་མུ་ཁྱུད་དང་། རྡོ་རྗེའི་མུ་ཁྱུད་དང་། བཟོད་པའི་མུ་ཁྱུད་དང་། གནས་ཀྱི་མུ་ཁྱུད་དང་། ཤུགས་ཀྱི་མུ་ཁྱུད་དང་། གཡུལ་གྱི་མུ་ཁྱུད་དང་།
en: In the same way, the prince Indragaṇa also gave all his wealth and honored the Bhagavat and the saṅgha of bhikṣus for three months.

source: སྒྲ་གཅན་དང་། སྒྲ་གཅན་སྟོབས་མེད་དང་། སྒྲ་གཅན་དགྲ་མེད་དང་། ཆུན་པོ་སྣ་ཚོགས་དང་། རྒྱལ་པོར་གནས་དང་། འདོད་ཆགས་མི་གནས་དང་། ནོར་བདག་དང་། སྲུང་བ་པོ་དང་། ལུས་བཟངས་དང་། བསམ་པ་དཔོག་དང་། སྡོམ་བརྩོན་འཁོར་དང་། སྤྲིན་ཆུང་དང་། ཡ་མ་ཐ་དང་། འགྲོ་བའི་རྒྱལ་མཚན་དང་། ངེས་འཚོ་དང་། ཡས་སྱ་ན་དང་།
en: Also in the same way, the princes Anaṅgaṇa, Abhaya, Ambara, Aśaja, Middha, Miṣa, Mārdava, Paṅgagaṇa, Mādhvava, Mānava, Great Principal, Mājava, Arava, Ājñava, Mukhava, Arthabahu, Alindra, Nerava, Reṇaja, Candranemin, Sūryanemin, Indranemin, Vajranemin, Kṣāntinemin, Sthānanemin, Javanemin, Raṇemin, Rāhu, Rāhubala, Rāhucitra, Dāmacitra, Rājadhāna, Rāgabhrama, Rāndhava, Rakṣaka, Kāya, Śayama, Yatrava, Syajala, Yārmatha, Yadhvaja, Yamāna, Yasyana, Namajyoti, and Asaṅga did the same.

source: སྐར་མ་འདུད་དང་། ཆགས་མེད་རྣམས་ཀྱིས་ཀྱང་དེ་བཞིན་དུ་བྱས་ཏེ། རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱི་བུ་སྟོང་གི་བར་དུ་རེ་རེས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་དགེ་སློང་གི་དགེ་འདུན་དཔག་ཏུ་མེད་པ་དང་བཅས་པ་ལ་ཟླ་བ་གསུམ་གསུམ་དུ་ན་བཟའ་དང་། བཤོས་དང་། གཟིམས་ཆ་དང་།
en: Each of the thousand sons of King Araṇemin for three months honored the tathāgata arhat samyaksam­buddha Ratnagarbha and his countless saṅgha of bhikṣus with offerings of food, beds, seats, medicines, and necessities.

source: གདན་དང་། སྙུན་གྱི་གསོས་སྨན་དང་། ཡོ་བྱད་ཀྱི་ཚོགས་དེ་ལྟ་བུ་དག་གིས་བསྙེན་བཀུར་བྱ་བས་བསྙེན་བཀུར་བྱས་ནས་རྒྱལ་བུ་ཐུ་བོས་ཇི་ལྟར་བྱས་པ་དེ་བཞིན་དུ་རེ་རེས་ཀྱང་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་གསེར་གྱི་འཁོར་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། སྨན་བཅུད་ཀྱིས་ལེན་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བར་དུ་རྒྱ་ཆེར་ཕུལ་ལོ།
en: When they honored him, as the crown prince had done, they each made a vast offering of 84,000 golden wheels, and so on, up to and including 84,000 medicinal elixirs, to the Bhagavat and the saṅgha of bhikṣus.

source: །དེ་ལྟ་བུའི་སྦྱིན་པ་ཆེན་པོ་བྱས་ནས་དེ་དག་ཁ་ཅིག་ནི་བརྒྱ་བྱིན་ཉིད་དུ་སྨོན། ཁ་ཅིག་ནི་ཚངས་པ་ཉིད་དུ་སྨོན། ཁ་ཅིག་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར། ཁ་ཅིག་ནི་ལོངས་སྤྱོད་ཆེན་པོར། ཁ་ཅིག་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པར་སྨོན་ཅིང་།
en: Having performed that great act of generosity, some of them prayed to become Śakra, some to become Brahmā, some to become a cakravartin, some to have great wealth, and some to be in the Śrāvakayāna.

source: ལོ་ཉིས་བརྒྱ་ལྔ་བཅུར་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་བཟོད་པར་གསོལ་ཏོ།
en: They then prayed for two hundred and fifty years and took their leave from the Bhagavat and the saṅgha of bhikṣus. “

source: །དེའི་ཚེ་ན་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་འོངས་ནས་འདི་ལྟ་སྟེ། ན་བཟའ་དང་། བཤོས་དང་།
en: At that time, the chief court priest Samudrareṇu arrived, and he saw the princes honoring the Bhagavat.

source: གཟིམས་ཆ་དང་། གདན་དང་། སྙུན་གྱི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་དང་། འཚོག་ཆས་ཐམས་ཅད་ཀྱིས་ལོ་བདུན་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་སྤྱན་དྲངས་པ་དང་།
en: Having seen that, he requested to provide the tathāgata arhat samyaksam­buddha Ratnagarbha and his saṅgha with all their robes, food, beds, seats, medicines, and necessities for seven years.

source: བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་ཡབ་མདུན་ན་འདོན་གྱི་གཙོ་བོ་ལ་གནང་བར་མཛད་དོ།
en: The Bhagavat gave his consent to his father, the chief court priest, by remaining silent.

source: །དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ། ཇི་ལྟར་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་བསྙེན་བཀུར་བྱས་པ་དེ་ལྟ་བུའི་ཡོ་བྱད་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱ་བས་བསྙེན་བཀུར་བྱས་སོ།
en: Then the brahmin Samudrareṇu honored the Tathāgata Ratnagarbha and his saṅgha of bhikṣus with every perfect service, just as King Araṇemin had done. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་དུས་གཞན་ཞིག་ན་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱི་སེམས་ལ་འདི་ལྟ་བུའི་ཡོངས་སུ་རྟོག་པ་སྐྱེས་ཏེ། བདག་གིས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དེ་སྙེད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཀྱང་བདག་གིས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་འདི་ལྷའི་རྒྱལ་སྲིད་དམ། མིའི་རྒྱལ་སྲིད་འདོད་དམ། ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་འདོད་དམ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདོད་དམ། འདི་ཅི་འདོད་པའི་སྨོན་ལམ་མི་ཤེས་ན། ཇི་སྟེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ཞིང་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་དག་ལས་མ་རྒལ་བའི་སེམས་ཅན་རྣམས་སྒྲོལ་བར་བྱེད་པ་དང་། མ་ཐར་བ་རྣམས་ཐར་བར་བྱེད་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱེད་པར་ལྟ་ན་རྒྱལ་པོ་འདི་ལྷའི་དཔལ་འདོད་དམ།
en: Then, noble son, at another time, this thought arose in the mind of brahmin Samudrareṇu: ‘I have caused many hundreds of thousands of millions of trillions of beings to become fixed upon the highest, most complete enlightenment, but I do not know what kind of prayer King Araṇemin made.

source: འོན་ཏེ་མིའི་དཔལ་ལམ། འོན་ཏེ་ཉན་ཐོས་ཉིད་དམ། འོན་ཏེ་རང་སངས་རྒྱས་ཀྱི་སའམ། འོན་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདོད་དམ། ཅི་འདོད་པ་ལྷའམ།
en: Did he wish for a divine kingdom or a human kingdom, for the way of the śrāvaka or the way of the pratyekabuddha, or for the highest, most complete enlightenment?

source: ཀླུའམ། གནོད་སྦྱིན་ནམ། སངས་རྒྱས་སམ། ཉན་ཐོས་སམ། བྲམ་ཟེ་འགའ་ཞིག་གིས་བདག་གི་རྨི་ལམ་དུ་སྦྲོན་གྲང་སྙམ་མོ།
en: If I am to be a samyaksam­buddha with the highest, most complete enlightenment, so that I may bring across beings who have not crossed over; liberate beings who have not been liberated from birth, old age, sickness, death, misery, lamenting, suffering, unhappiness, and troubles; and bring to nirvāṇa those who have not reached nirvāṇa, then may a deva, a nāga, a yakṣa, a buddha, a śrāvaka, or a brahmin tell me in a dream whether the king wished for the splendor of the devas, the splendor of humans, the state of a śrāvaka, the level of a pratyekabuddha, or the highest, most complete enlightenment.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱི་རྨི་ལམ་ན་སྣང་བ་གང་གིས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཐོང་བ་དེ་ལྟ་བུའི་སྣང་བ་མཐོང་ཞིང་།
en: Then, noble son, the brahmin Samudrareṇu, the chief court priest, saw a vision in a dream. In the vision he saw in the ten directions the bhagavat buddhas in buddha realms as numerous as the grains of sand in the Ganges River.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བྲམ་ཟེ་དེ་ལ་པད་མ་འདབ་མ་རྣམས་ནི་གསེར། སྡོང་བུ་རྣམས་ནི་དངུལ། སྙིང་པོ་རྣམས་ནི་བཻ་དཱུརྱ། ཟེ་བ་རྣམས་ནི་རྡོའི་སྙིང་པོ་ལས་བྱས་པ་དག་བསྐུར་ཏེ།
en: Those bhagavat buddhas gave the brahmin lotuses with gold petals, silver stems, beryl pericarps, and emerald anthers.

source: པད་མ་དེ་དག་ཐམས་ཅད་ལ་ཡང་ཉི་མའི་དཀྱིལ་འཁོར་དག་ཀུན་ཏུ་སྣང་ཞིང་།
en: Upon those lotuses were sun disks.

source: ཉི་མའི་དཀྱིལ་འཁོར་དེ་དག་གི་སྟེང་ན་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གདུགས་དག་ཀུན་ནས་གནས་པ་དང་།
en: Upon those sun disks stood parasols made of the seven jewels.

source: ཉི་མའི་དཀྱིལ་འཁོར་རེ་རེ་ལས་ཀྱང་འོད་ཟེར་བྱེ་བ་ཕྲག་དྲུག་ཅུ་དྲུག་ཅུ་བྱུང་བར་གྱུར་ནས་འོད་ཟེར་དེ་དག་ཐམས་ཅད་བྲམ་ཟེ་དེའི་ཁར་ཞུགས་པ་དང་།
en: Each sun disk emitted 600,000,000 light rays. All those light rays entered the brahmin’s mouth.

source: བདག་གི་ལུས་དཔག་ཚད་སྟོང་གི་ཚད་ཙམ་དུ་གྱུར་ཅིང་འདི་ལྟ་སྟེ། དཔེར་ན་མེ་ལོང་གི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པ་བཞིན་དུ་ཡོངས་སུ་དག་པར་མཐོང་བ་དང་།
en: He saw his own body become a thousand yojanas high, and completely clear like a completely clear mirror.

source: ལུས་ཀྱི་ཁོང་པ་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དྲུག་ཅུ་པད་མ་དག་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་ཅིང་བསམ་གཏན་བསྒོམ་པ་དག་ཀྱང་མཐོང་ངོ་།
en: He saw that within his body there were hundreds of thousands of millions of trillions of bodhisattvas sitting cross-legged in meditation.

source: །ཉི་མའི་དཀྱིལ་འཁོར་གྱི་གཟུགས་དེ་དག་ཀྱང་བདག་གི་མགོ་ལ་ཕྲེང་བ་དངར་བར་མཐོང་ཞིང་གདུགས་རྣམས་ཀྱང་སྟེང་གི་ནམ་མཁའ་ལ་ཚངས་པའི་འཇིག་རྟེན་གྱི་མཐར་ཐུག་པའི་བར་དུ་གནས་པ་མཐོང་ངོ་།
en: He saw those suns arranged as a garland upon his head. He saw that the parasols reached as high in the sky as the realm of Brahmā.

source: །ཁོ་ར་ཁོར་ཡུག་ན་ཡང་པད་མ་སྣ་ཚོགས་དག་ཡོད་པར་མཐོང་ཞིང་པད་མ་དེ་དག་ལས་ལྷའི་སིལ་སྙན་མིའི་ལས་ཤིན་ཏུ་འདས་པ་དག་བྱུང་སྟེ་སྒྲ་ཡང་གྲག་གོ།
en: He saw a variety of lotuses all around him. He heard divine music, which transcended human music, emanating from those lotuses. “

source: །དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ལུས་ཁྲག་གིས་བསྐུས་ཤིང་ཕག་གི་གདོང་དུ་གྱུར་ནས་རྒྱུག་ཅིང་སྲོག་ཆགས་རྣམ་པ་མང་པོ་དག་ལ་ཟ་བ་དང་།
en: He then saw King Araṇemin running. His body was red with blood, he had a boar’s face, and he was devouring many creatures.

source: ཟོས་ནས་ཀྱང་ཨེ་རན་དའི་ཤིང་དྲུང་ན་སྙེས་ཤིང་འདུག་པ་དང་།
en: When he had finished eating them, he sat at the foot of a castor-oil tree.

source: སྲོག་ཆགས་སྣ་ཚོགས་དག་འོངས་ཏེ་རྒྱལ་པོ་དེ་ཟོས་པ་ནས་ཀེང་རུས་ཀྱི་བར་ལ་ཐུག་པར་བྱས་ཏེ་བོར་བ་དང་།
en: Then various animals gathered and ate the king until there was nothing left but scattered bones. “

source: དེ་བཞིན་དུ་ཡང་དང་ཡང་ཕྱིར་སྐྱེས་པས་ཕག་གི་གདོང་དུ་གྱུར་ཅིང་ལུས་ཁྲག་གིས་བསྐུས་ཏེ་སྲོག་ཆགས་རྣམ་པ་མང་པོ་དག་ཟོས་ནས་ཨེ་རན་དའི་ཤིང་དྲུང་ན་འདུག་པ་དང་།
en: Again and again, he appeared with a boar’s face and a body red with blood.

source: སྲོག་ཆགས་སྣ་ཚོགས་དག་གིས་ཟོས་ཤིང་ཀེང་རུས་ལ་ཐུག་པར་བྱས་ཏེ་བོར་བ་དག་མཐོང་ངོ་།
en: He devoured many creatures, sat at the foot of a castor-oil tree, and was eaten by various animals until there was nothing left but scattered bones. “

source: །གཞན་ཡང་རྒྱལ་བུ་དག་ཀྱང་ལ་ལ་ནི་ཕག་གི་གདོང་། ལ་ལ་ནི་གླང་པོ་ཆེའི་གདོང་། ལ་ལ་ནི་མ་ཧེའི་གདོང་། ལ་ལ་ནི་སེང་གེའི་གདོང་། ལ་ལ་ནི་སྤྱང་ཀིའི་གདོང་།
en: He also saw the princes, some with boar faces, some with elephant faces, some with buffalo faces, some with lion faces, some with jackal faces, some with fox faces, some with dog faces, and some with monkey faces.

source: ལ་ལ་ནི་ཝའི་གདོང་། ལ་ལ་ནི་ཁྱིའི་གདོང་། ལ་ལ་ནི་སྤྲེའུའི་གདོང་དུ་གྱུར་པར་མཐོང་ཞིང་ལུས་དག་ལ་ཁྲག་གིས་གཏོར་ཏེ་སྲོག་ཆགས་རྣམ་པ་མང་པོ་དག་ཟོས་ནས་ཨེ་རན་དའི་ཤིང་དྲུང་ན་འདུག་པ་དང་། སྲོག་ཆགས་རྣམ་པ་མང་པོ་དག་གིས་ཟོས་ཤིང་ཀེང་རུས་ལ་ཐུག་པར་བྱས་ཏེ་བོར་བ་མཐོང་ངོ་།
en: Their bodies soaked with blood, they ate many animals, sat at the foot of a castor-oil tree, and were then eaten by many animals until there was nothing left but scattered bones. “

source: །ཡང་ལུས་དེ་ཉིད་ལ་གནས་ཤིང་སྲོག་ཆགས་དག་ལ་ཟ་བར་ཡང་མཐོང་ངོ་།
en: He saw them again and again, eating animals in those bodies.

source: །རྒྱལ་བུ་ཁ་ཅིག་ནི་སྣ་མའི་མེ་ཏོག་གིས་བརྒྱན་ཅིང་མ་ཧེའི་ཤིང་རྟ་དག་ལ་ཞོན་ཏེ་ལམ་གོལ་བར་ཞུགས་ནས་གཡས་ཕྱོགས་སུ་བལྟས་ཤིང་དོང་བར་མཐོང་ངོ་། །བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་།
en: He saw other princes, adorned with jasmine flowers, riding in buffalo-drawn carts, heading south on a bad road.

source: འཇིག་རྟེན་སྐྱོང་བ་དག་ཀྱང་འོངས་ནས་བྲམ་ཟེ་ལ་སྨྲས་པ། ཀྱེ་བྲམ་ཟེ་ཁྱོད་ཀྱི་ཁོ་ར་ཁོར་ཡུག་ན་པད་མ་ཡོད་པ་གང་ཡིན་པ་དེ་དག་ལས་ཁྱོད་ཀྱིས་དང་པོར་པད་མ་གཅིག་ནི་རྒྱལ་པོའི་སྐལ་བར་ཕུལ་ཅིག །དེ་ནས་རྒྱལ་བུ་འདི་དག་ལ་ཡང་པད་མ་རེ་རེ་བྱིན་ཅིག །ལྷག་མ་རྣམས་ནི་ཁམས་ཀྱི་རྒྱལ་པོ་རྣམས་ལ་བྱིན་ཅིག །གཞན་དག་ནི་སྐྱེ་བོ་རྣམས་ལ་བྱིན་ཅིག །
en: Śakra, Brahmā, and the guardians of the world also came there and said to the brahmin, ‘O brahmin, you should first offer one of these lotuses that are around you to the king and then give one to each of the princes, then to the minor kings, and then to the rest to the people.’ “
